pascallanger/DIY-Multiprotocol-TX-Module/BootLoaders/AtmegaMultiBoot/Source/optiboot.c
      getch();			/* getlen() */
      length = getch();
      getch();

			// If we are in RWW section, immediately start page erase
      if (address < NRWWSTART) __boot_page_erase_short((uint16_t)(void*)address);

      // While that is going on, read in page contents
      bufPtr = buff;
      do *bufPtr++ = getch();
      while (--length);

      // If we are in NRWW section, page erase has to be delayed until now.
      // Todo: Take RAMPZ into account
#ifdef MULTI_CALLED
      if (address < 0x7E00)
#endif
      {
	      if (address >= NRWWSTART) __boot_page_erase_short((uint16_t)(void*)address);
			}
      // Read command terminator, start reply
      verifySpace();

      // If only a partial page is to be programmed, the erase might not be complete.
      // So check that here
#ifdef MULTI_CALLED
      if (address < 0x7E00)
#endif
      {
	      boot_spm_busy_wait();

#ifdef VIRTUAL_BOOT_PARTITION
      	if ((uint16_t)(void*)address == 0) {
      	  // This is the reset vector page. We need to live-patch the code so the
      	  // bootloader runs.
      	  //
      	  // Move RESET vector to WDT vector
      	  uint16_t vect = buff[0] | (buff[1]<<8);
      	  rstVect = vect;
      	  wdtVect = buff[8] | (buff[9]<<8);
      	  vect -= 4; // Instruction is a relative jump (rjmp), so recalculate.
      	  buff[8] = vect & 0xff;
      	  buff[9] = vect >> 8;

      	  // Add jump to bootloader at RESET vector
      	  buff[0] = 0x7f;
      	  buff[1] = 0xce; // rjmp 0x1d00 instruction
      	}
#endif

      // Copy buffer into programming buffer
      	bufPtr = buff;
      	addrPtr = (uint16_t)(void*)address;
      	ch = SPM_PAGESIZE / 2;
      	do {
      	  uint16_t a;
	//        a = *bufPtr++;
	//        a |= (*bufPtr++) << 8;

					a = *((uint16_t *)bufPtr) ;
					bufPtr += 2 ;

      	  __boot_page_fill_short((uint16_t)(void*)addrPtr,a);
      	  addrPtr += 2;
      	} while (--ch);

      // Write from programming buffer
      	__boot_page_write_short((uint16_t)(void*)address);
    	  boot_spm_busy_wait();

#if defined(RWWSRE)
  	    // Reenable read access to flash
	      boot_rww_enable();
#endif
			}
    }
    /* Read memory block mode, length is big endian.  */
    else if(ch == STK_READ_PAGE)
		{
		  register uint8_t  length;
      // READ PAGE - we only read flash
      getch();			/* getlen() */
      length = getch();
      getch();

      verifySpace();
#ifdef VIRTUAL_BOOT_PARTITION
      do {
        // Undo vector patch in bottom page so verify passes
        if (address == 0)       ch=rstVect & 0xff;
        else if (address == 1)  ch=rstVect >> 8;
        else if (address == 8)  ch=wdtVect & 0xff;
        else if (address == 9) ch=wdtVect >> 8;
        else ch = pgm_read_byte_near(address);
        address++;
        putch(ch);
      } while (--length);
#else
#ifdef RAMPZ
// Since RAMPZ should already be set, we need to use EPLM directly.
//      do putch(pgm_read_byte_near(address++));
//      while (--length);
      do {
        uint8_t result;
        __asm__ ("elpm %0,Z\n":"=r"(result):"z"(address));
        putch(result);
        address++;
      }
      while (--length);
#else
      do putch(pgm_read_byte_near(address++));
      while (--length);
#endif
#endif
    }

    /* Get device signature bytes  */
    else if(ch == STK_READ_SIGN)
		{
      // READ SIGN - return what Avrdude wants to hear
      verifySpace();
      putch(SIGNATURE_0);
      putch(SIGNATURE_1);
      putch(SIGNATURE_2);
    }
    else if (ch == STK_LEAVE_PROGMODE) { /* 'Q' */
      // Adaboot no-wait mod

//      watchdogConfig(WATCHDOG_16MS);
      
			verifySpace();
#ifdef MULTI_CALLED
	    putch(STK_OK);
		  while (!(UART_SRA & _BV(TXC0)));
			appStart() ;
#endif
    }
    else
		{
      // This covers the response to commands like STK_ENTER_PROGMODE
      verifySpace();
    }
    putch(STK_OK);
  }
}

void putch(char ch) {
#ifndef SOFT_UART
  while (!(UART_SRA & _BV(UDRE0)));
  UART_UDR = ch;
#else
  __asm__ __volatile__ (
    "   com %[ch]\n" // ones complement, carry set
    "   sec\n"
    "1: brcc 2f\n"
    "   cbi %[uartPort],%[uartBit]\n"
    "   rjmp 3f\n"
    "2: sbi %[uartPort],%[uartBit]\n"
    "   nop\n"
    "3: rcall uartDelay\n"
    "   rcall uartDelay\n"
    "   lsr %[ch]\n"
    "   dec %[bitcnt]\n"
    "   brne 1b\n"
    :
    :
      [bitcnt] "d" (10),
      [ch] "r" (ch),
      [uartPort] "I" (_SFR_IO_ADDR(UART_PORT)),
      [uartBit] "I" (UART_TX_BIT)
    :
      "r25"
  );
#endif
}

uint8_t getch(void) {
  uint8_t ch;

#ifdef LED_DATA_FLASH
#ifdef __AVR_ATmega8__
  LED_PORT ^= _BV(LED);
#else
  LED_PIN |= _BV(LED);
#endif
#endif

#ifdef SOFT_UART
  __asm__ __volatile__ (
    "1: sbic  %[uartPin],%[uartBit]\n"  // Wait for start edge
    "   rjmp  1b\n"
    "   rcall uartDelay\n"          // Get to middle of start bit
    "2: rcall uartDelay\n"              // Wait 1 bit period
    "   rcall uartDelay\n"              // Wait 1 bit period
    "   clc\n"
    "   sbic  %[uartPin],%[uartBit]\n"
    "   sec\n"
    "   dec   %[bitCnt]\n"
    "   breq  3f\n"
    "   ror   %[ch]\n"
    "   rjmp  2b\n"
    "3:\n"
    :
      [ch] "=r" (ch)
    :
      [bitCnt] "d" (9),
      [uartPin] "I" (_SFR_IO_ADDR(UART_PIN)),
      [uartBit] "I" (UART_RX_BIT)
    :
      "r25"
);
#else
  while(!(UART_SRA & _BV(RXC0)))
		
//		watchdogReset()
    
		;
//  if (!(UART_SRA & _BV(FE0))) {
      /*
       * A Framing Error indicates (probably) that something is talking
       * to us at the wrong bit rate.  Assume that this is because it
       * expects to be talking to the application, and DON'T reset the
       * watchdog.  This should cause the bootloader to abort and run
       * the application "soon", if it keeps happening.  (Note that we
       * don't care that an invalid char is returned...)
       */
//    watchdogReset();
//  }

  ch = UART_UDR;
#endif

#ifdef LED_DATA_FLASH
#ifdef __AVR_ATmega8__
  LED_PORT ^= _BV(LED);
#else
  LED_PIN |= _BV(LED);
#endif
#endif

  return ch;
}

#ifdef SOFT_UART
// AVR305 equation: #define UART_B_VALUE (((F_CPU/BAUD_RATE)-23)/6)
// Adding 3 to numerator simulates nearest rounding for more accurate baud rates
#define UART_B_VALUE (((F_CPU/BAUD_RATE)-20)/6)
#if UART_B_VALUE > 255
#error Baud rate too slow for soft UART
#endif

void uartDelay() {
  __asm__ __volatile__ (
    "ldi r25,%[count]\n"
    "1:dec r25\n"
    "brne 1b\n"
    "ret\n"
    ::[count] "M" (UART_B_VALUE)
  );
}
#endif

void getNch(uint8_t count) {
  do getch(); while (--count);
  verifySpace();
}

void verifySpace()
{
  if ( getch() != CRC_EOP) {
    
  	putch(STK_NOSYNC);
//		watchdogConfig(WATCHDOG_16MS);    // shorten WD timeout
//    
//		while (1)			      // and busy-loop so that WD causes
//      ;				      //  a reset and app start.
  }
  putch(STK_INSYNC);
}

#if LED_START_FLASHES > 0
void flash_led(uint8_t count) {
  do {
    TCNT1 = -(F_CPU/(1024*16));
    TIFR1 = _BV(TOV1);
    while(!(TIFR1 & _BV(TOV1)));
//#ifdef __AVR_ATmega8__
    LED_PORT ^= _BV(LED);
//#else
//    LED_PIN |= _BV(LED);
//#endif
    watchdogReset();
  } while (--count);
}
#endif

// Watchdog functions. These are only safe with interrupts turned off.
void watchdogReset() {
  __asm__ __volatile__ (
    "wdr\n"
  );
}

void watchdogConfig(uint8_t x) {
  WDTCSR = _BV(WDCE) | _BV(WDE);
  WDTCSR = x;
}

void appStart()
{
//  watchdogConfig(WATCHDOG_OFF);
//  __asm__ __volatile__ (
//#ifdef VIRTUAL_BOOT_PARTITION
//    // Jump to WDT vector
//    "ldi r30,4\n"
//    "clr r31\n"
//#else
//    // Jump to RST vector
//    "clr r30\n"
//    "clr r31\n"
//#endif
//    "ijmp\n"
//  );

	register void (*p)() ;
	p = 0 ;

	if ( pgm_read_byte( (uint16_t)p ) != 0xFF )
	{
		(*p)() ;
	}
}

